'''Напишите программу, которая найдет сколько полных килограмм умещается в заданное число грамм.

Формат входных данных
На вход программе подаётся натуральное число – количество грамм.

Формат выходных данных
Программа должна вывести одно число – полное число килограмм .

 1кг = 1000г'''

print(int(input())//1000)
