'''Напишите программу, которая сначала считывает три фразы по очереди, а потом воспроизводит их в обратной последовательности, каждую на отдельной строчке.'''

a = input()
b = input()
c = input()
print(c, b, a, sep='\n')
