'''Программа получает на вход строку и ваша задача вывести первый элемент данной строки'''

print(input()[0])
