'''Напишите программу, которая считывает слово, затем выводит:

«Что Вы сказали? [это слово] ? Какое интересное слово».'''

a = input()
print("Что Вы сказали? {a}? Какое интересное слово".format(a=a))
