'''На год старше
Напишите программу, которая принимает на вход возраст человека (количество полных лет) и выводит сколько лет ему исполнится в следующем году'''

print(int(input())+1)