'''Найдите результат выражения |a| + |b|∣a∣+∣b∣

Значения переменных а и b поступают на вход в отдельных строках и могут быть только целого типа'''

a = abs(int(input()))
b = abs(int(input()))

print(a + b)